Repository: DevSchell/desafio_final_lincetech_academy
Catalog: lib/l10n/app_*.arb
Languages: es, pt

source: No trips added
es: No se han añadido viajes
pt: Sem viagens adicionadas

source: Language
es: Idioma
pt: Idioma

# themeHeader
source: Theme
es: Tema
pt: Tema

source: Light Theme
es: Tema Claro
pt: Tema Claro

source: Dark Theme
es: Tema Oscuro
pt: Tema Escuro

source: Trip Title
es: Título del Viaje
pt: Título da Viagem

source: Enter title here...
es: Ingrese el título aquí...
pt: Escreva o título aqui...

source: Start date
es: Inicio
pt: Início

source: End date
es: Finalización
pt: Fim

# noDateSelected
source: No date
es: Sin fecha
pt: Sem data

# transportationMethodHeader
source: Transportation Method
es: Método de Transporte
pt: Método de Transporte

# requestedExperiencesHeader
source: Requested Experiences
es: Experiencias Solicitadas
pt: Experiências Solicitadas

source: Participant List
es: Lista de Participantes
pt: Lista de Participantes

# noParticipantsAdded
source: No participants added yet
es: Aún no se han añadido participantes
pt: Sem participantes adicionados

# addParticipantButton
source: Add participant
es: Añadir participante
pt: Adicionar participante

# settingsHeader
source: Settings
es: Configuración
pt: Configurações

# createNewTripHeader
source: Create a new trip
es: Crear un nuevo viaje
pt: Criar uma nova viagem

# cultureExperience
source: Culture
es: Cultura
pt: Cultura

# cuisineExperience
source: Cuisine
es: Culinaria
pt: Culinária

# hikingExperience
source: Hiking
es: Senderismo
pt: Trilha

# swimmingExperience
source: Swimming
es: Natación
pt: Natação

# wildlifeExperience
source: Wildlife
es: Vida salvaje
pt: Vida Selvagem

# artExperience
source: Art
es: Arte
pt: Arte

# festivalsExperience
source: Festivals
es: Festivales
pt: Festivais

# shoppingExperience
source: Shopping
es: Compras
pt: Compras

# adventureExperience
source: Adventure
es: Aventura
pt: Aventura

# discardFiles
source: Discard filled fields until now?
es: ¿Descartar los campos rellenados hasta ahora?
pt: Descartar mudanças?

# informationWillBeErased
source: The information on the fields will be erased
es: La información de los campos se borrará
pt: As informações dos campos serão apagadas

source: Cancel
es: Cancelar
pt: Cancelar

source: Discard changes
es: Descartar cambios
pt: Descartar

source: This field can't be null
es: Este campo no puede ser nulo
pt: Esse campo não pode estar vazio

# nameField
source: Name:
es: Nombre:
pt: Nome:

# ageField
source: Age:
es: Edad:
pt: Idade:

# transportField
source: Transport:
es: Transporte:
pt: Transporte:

source: Stopover List
es: Lista de Paradas
pt: Lista de Paradas

# noStopoverAddedYet
source: No stopovers added yet
es: Ninguna parada añadida aún
pt: Sem paradas adicionadas

source: Stopover deleted successfully
es: Parada eliminada con éxito
pt: Parada excluída com sucesso!

source: addStopover
es: Añadir parada
pt: Adicionar Parada

source: Create trip
es: Crear viaje
pt: Criar viagem

source: Choose picture from...
es: Elegir foto de...
pt: Escolher foto...

source: Choose from camera
es: Elegir de la cámara
pt: Da câmera

source: Choose from gallery
es: Elegir de la galería
pt: Da galeria

source: Name
es: Nombre
pt: Nome

source: Enter name here...
es: Introduce un nombre aquí...
pt: Insira o nome aqui...

source: Age
es: Edad
pt: Idade

source: Enter age here...
es: Introduce la edad aquí...
pt: Insira idade aqui...

source: Favorite Transport
es: Transporte favorito
pt: Transporte Favorito

source: Add
es: Añadir
pt: Adicionar

source: City Name
es: Nombre de la ciudad
pt: Nome da Cidade

source: was added successfully
es: se ha añadido con éxito
pt: ÇÇÇ foi adicionada com sucesso

source: Stopover successfully added!
es: ¡Parada añadida con éxito!
pt: Parada adicionada com sucesso!

# thereWasAnErrorNominatimAPI
source: There was an error on the attempt of searching places
es: Ha ocurrido un error al intentar buscar lugares
pt: Houve um erro ao tentar procurar por locais

# addPhoto
source: Add a photo
es: Añadir una foto
pt: Adicionar uma foto

source: Add Review
es: Añadir un relato
pt: Adicionar um relato

source: Review Message
es: Mensaje del relato
pt: Mensagem do relato

source: Review Owner
es: Dueño del relato
pt: Autor do relato

# labelSelectOwner
source: Select the owner of the review
es: Elija el dueño del relato
pt: Selecione o autor do relato

source: select date
es: Elija una fecha
pt: Selecione uma data

# errorNameCantBeNull
source: Name can't be null
es: Nombres no pueden ser nulos
pt: Nome não pode ser nulo

# errorDateCantBeNull
source: Date of birth can't be null
es: fecha de nascimiento no puedem ser nulas
pt: Data de nascimento não pode ser nula

# errorProfilePhotoCantBeNull
source: Profile photo can't be null
es: La foto no puede ser nula
pt: Foto de perfil não pode ser nula

source: OK
es: Vale

source: Validation Error
es: Error de validación
pt: Erro de validação

# errorCityName
source: City name can't be null
es: El nombre de la ciudad no puede ser nulo
pt: Nome da cidadae não pode ser nulo

# errorExperience
source: Select at least 1 experience
es: Selecciona al menos 1 experiencia
pt: Selecione ao menos 1 experiência

source: Unknown Participant
es: Participante desconocido
pt: Participante Desconhecido

# noStopovers
source: There are no stopovers to be shown
es: No hay paradas para mostrar
pt: Não existem paradas a serem mostradas

# deletedParticipant
source: Participant deleted successfully
es: Participante eliminado con éxito
pt: Participante excluído com êxito

# errorTripTitleCantBeNull
source: Trip title can't be null
es: El título del viaje no puede ser nulo
pt: Título da viagem não pode ser nulo

# errorParticipant
source: Add at least 1 participant
es: Añade al menos 1 participante
pt: Adicione pelo menos 1 participante

# errorStopover
source: Add at least 1 stopover
es: Añade al menos 1 parada
pt: Adicione pelo menos 1 parada

# tripCreatedSuccessfully
source: Trip create successfully
es: Viaje creado con éxito
pt: Viagem criada com êxito

source: Activities
es: Actividades
pt: Atividades

source: No activities planned
es: No hay actividades planeadas
pt: Sem atividades planejadas

source: Map Location
es: Ubicación en el mapa
pt: Localização no mapa

# reviewsHeader
source: Reviews
es: Reseñas
pt: Relatos

source: No reviews yet
es: No hay reseñas aún
pt: Sem relatos adicionada

# youAreAboutToDeleteReview
source: You're about to delete this review
es: Estás a punto de eliminar esta reseña
pt: Você está prestes excluir esse relato

# areYouSureReview
source: Are you sure you want to delete this review?
es: ¿Estás seguro de que quieres eliminar esta reseña?
pt: Tem certeza que você quer excluir esse review

source: Yes
es: Sí
pt: Sim

source: Review deleted successfully
es: Reseña eliminada con éxito
pt: Relato excluído com êxito

source: Trip Details
es: Detalles del viaje
pt: Detalhes da Viagem

source: PDF generated successfully
es: PDF generado con éxito
pt: PDF gerado com sucesso

# errorWhileGeneratingPDF
source: Error while generating the PDF
es: Error al generar el PDF
pt: Erro ao gerar o PDF

source: You are about to delete your trip
es: Estás a punto de eliminar tu viaje
pt: Você está prestes a apagar a sua viagem

# areYouSureYouWantToDeleteYourTrip
source: Are you sure you want to delete this trip?
es: ¿Estás seguro de que quieres eliminar este viaje?
pt: Tem certeza que você quer apagar a viagem?

source: Trip deleted successfully
es: Viaje eliminado con éxito
pt: Viagem apagada com êxito

source: No
pt: Não
